In [1]:
import pandas as pd

In [2]:
# initialize list for the dataframe
data = [['Adam','male','Ph.D','NY','M', True],['Dina','female','M.S','NY','D',True], 
        ['John','male','AS','MI','S',False],['Elton','male','HS','AL','M', True],
        ['Gina','female','HS','AK','D', False],['Sara', 'female','M.S','AZ','S',True], 
        ['Lana','female','AS', 'CA','M',False],['Tim','male','Ph.D','AR','D', True],
        ['Suzan','female','M.S','AZ','S',True], ['Aj','male','AS','CA','M',False],
        ['Luke','male','HS','CA','D', True],['Salma','female','HS','CA','S', False],
        ['Abby', 'female','M.S','CA','M',True], ['Sandra','female','HS','CO','D', False],
        ['Zen','male','Ph.D','CO','S', True],['Emma','female','M.S','DC','M',True], 
        ['Owen','male','AS','DE','D',False],['Levi','male','HS','CT','S',True],
        ['Eva','female','HS','DC','M', False],['Sophia', 'female','M.S','DC','D',True], 
        ['Ella','female','HS','FL','S', False],['Jacob','male','Ph.D','IL','M', True],
        ['Mia','female','M.S','FL','D',True], ['Ethan','male','AS','FL','S',False],
        ['Luke','male','HS','IL','M', True],['Nadia','female','HS','IN','D', False],
        ['Tulip', 'female','M.S','IA','S',True],['Linda','female','HS','KS','M', False],
        ['Jack','male','Ph.D','KI','D', True],['Kindra','female','M.S','LA','S',True],
        ['Manson','male','AS','ME','M',False],['Logan','male','HS','MD','D', True],
        ['Luna','female','HS','MA','S', False],['Layla', 'female','M.S','MN','M',True],
        ['Lynn','female','HS','MS','D', False],['Nora','male','Ph.D','MS','S', True],
        ['Suzy','female','M.S','MO','M',True], ['Lucas','male','AS','MT','D',False],
        ['Chad','male','HS','TX','S', True], ['Soleen','female','HS','TX','M',False],
        ['Zoey', 'female','M.S','NY','D',True], ['Ellie','female','HS','TX','S', False],
        ['Oliver','male','Ph.D','TX','M',True],['Tamara','female','M.S','NJ','D',True], 
        ['Noah','male','AS','NJ','S',False], ['Liam','male','HS','MI','M', True],
        ['Stella','female','HS','NM','D', False],['Audrey', 'female','M.S','NC','S',True], 
        ['Lucy','female','HS','ND','M', False],['Timmy','male','Ph.D','OH','D', True],
        ['Bella','female','M.S','OH','S',True], ['William','male','AS','OK','M',False],
        ['Brian','male','HS','OK','D', True],['Nova','female','HS','OR','S', False],
        ['AnnaAbby', 'female','M.S','MI','M',True], ['Elena','female','HS','NY','D', False]]

In [3]:
# Create dataframe
df = pd.DataFrame(data, columns = ['Name', 'Gender','Education','State','Marital Status','Employed'])

In [4]:
df.shape

(56, 6)

In [5]:
df.head()

    Name  Gender Education State Marital Status  Employed
0   Adam    male      Ph.D    NY              M      True
1   Dina  female       M.S    NY              D      True
2   John    male        AS    MI              S     False
3  Elton    male        HS    AL              M      True
4   Gina  female        HS    AK              D     False

### One Hot Encoding

#### get_dummies

In [6]:
pd.get_dummies(df['Gender']).head()

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [7]:
pd.get_dummies(df['Marital Status'],drop_first=False).head()

   D  M  S
0  0  1  0
1  1  0  0
2  0  0  1
3  0  1  0
4  1  0  0

In [8]:
df0 = df.copy()

#### One Hot Encoder from sklearn

In [9]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(sparse=False)
ohe.fit_transform(df0[['Marital Status']])

array([[0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.]])

### Label Encoding

In [10]:
from sklearn.preprocessing import LabelEncoder 
lbe = LabelEncoder()
df['Marital Status']= lbe.fit_transform(df['Marital Status']) 
df.head()

    Name  Gender Education State  Marital Status  Employed
0   Adam    male      Ph.D    NY               1      True
1   Dina  female       M.S    NY               0      True
2   John    male        AS    MI               2     False
3  Elton    male        HS    AL               1      True
4   Gina  female        HS    AK               0     False

### Ordinal Encoder

In [11]:
df['Education'].unique()

array(['Ph.D', 'M.S', 'AS', 'HS'], dtype=object)

In [12]:
from sklearn.preprocessing import OrdinalEncoder
ordinal = OrdinalEncoder(categories=[['HS', 'AS', 'M.S','Ph.D']])  
df['Education'] = ordinal.fit_transform(df[['Education']])
df.head()

    Name  Gender  Education State  Marital Status  Employed
0   Adam    male        3.0    NY               1      True
1   Dina  female        2.0    NY               0      True
2   John    male        1.0    MI               2     False
3  Elton    male        0.0    AL               1      True
4   Gina  female        0.0    AK               0     False